SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_letimer.h
/* Bit fields for LETIMER IPVERSION */
#define _LETIMER_IPVERSION_RESETVALUE           0x00000001UL                            /**< Default value for LETIMER_IPVERSION         */
#define _LETIMER_IPVERSION_MASK                 0xFFFFFFFFUL                            /**< Mask for LETIMER_IPVERSION                  */
#define _LETIMER_IPVERSION_IPVERSION_SHIFT      0                                       /**< Shift value for LETIMER_IPVERSION           */
#define _LETIMER_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                            /**< Bit mask for LETIMER_IPVERSION              */
#define _LETIMER_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                            /**< Mode DEFAULT for LETIMER_IPVERSION          */
#define LETIMER_IPVERSION_IPVERSION_DEFAULT     (_LETIMER_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for LETIMER_IPVERSION  */

/* Bit fields for LETIMER EN */
#define _LETIMER_EN_RESETVALUE                  0x00000000UL                            /**< Default value for LETIMER_EN                */
#define _LETIMER_EN_MASK                        0x00000003UL                            /**< Mask for LETIMER_EN                         */
#define LETIMER_EN_EN                           (0x1UL << 0)                            /**< module en                                   */
#define _LETIMER_EN_EN_SHIFT                    0                                       /**< Shift value for LETIMER_EN                  */
#define _LETIMER_EN_EN_MASK                     0x1UL                                   /**< Bit mask for LETIMER_EN                     */
#define _LETIMER_EN_EN_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for LETIMER_EN                 */
#define LETIMER_EN_EN_DEFAULT                   (_LETIMER_EN_EN_DEFAULT << 0)           /**< Shifted mode DEFAULT for LETIMER_EN         */
#define LETIMER_EN_DISABLING                    (0x1UL << 1)                            /**< Disablement busy status                     */
#define _LETIMER_EN_DISABLING_SHIFT             1                                       /**< Shift value for LETIMER_DISABLING           */
#define _LETIMER_EN_DISABLING_MASK              0x2UL                                   /**< Bit mask for LETIMER_DISABLING              */
#define _LETIMER_EN_DISABLING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LETIMER_EN                 */
#define LETIMER_EN_DISABLING_DEFAULT            (_LETIMER_EN_DISABLING_DEFAULT << 1)    /**< Shifted mode DEFAULT for LETIMER_EN         */

/* Bit fields for LETIMER SWRST */
#define _LETIMER_SWRST_RESETVALUE               0x00000000UL                            /**< Default value for LETIMER_SWRST             */
#define _LETIMER_SWRST_MASK                     0x00000003UL                            /**< Mask for LETIMER_SWRST                      */
#define LETIMER_SWRST_SWRST                     (0x1UL << 0)                            /**< Software reset command                      */
#define _LETIMER_SWRST_SWRST_SHIFT              0                                       /**< Shift value for LETIMER_SWRST               */
#define _LETIMER_SWRST_SWRST_MASK               0x1UL                                   /**< Bit mask for LETIMER_SWRST                  */
#define _LETIMER_SWRST_SWRST_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LETIMER_SWRST              */
#define LETIMER_SWRST_SWRST_DEFAULT             (_LETIMER_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for LETIMER_SWRST      */
#define LETIMER_SWRST_RESETTING                 (0x1UL << 1)                            /**< Software reset busy status                  */
#define _LETIMER_SWRST_RESETTING_SHIFT          1                                       /**< Shift value for LETIMER_RESETTING           */
#define _LETIMER_SWRST_RESETTING_MASK           0x2UL                                   /**< Bit mask for LETIMER_RESETTING              */
#define _LETIMER_SWRST_RESETTING_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LETIMER_SWRST              */
#define LETIMER_SWRST_RESETTING_DEFAULT         (_LETIMER_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for LETIMER_SWRST      */

/* Bit fields for LETIMER CTRL */
#define _LETIMER_CTRL_RESETVALUE                0x00000000UL                            /**< Default value for LETIMER_CTRL              */
#define _LETIMER_CTRL_MASK                      0x000F13FFUL                            /**< Mask for LETIMER_CTRL                       */
#define _LETIMER_CTRL_REPMODE_SHIFT             0                                       /**< Shift value for LETIMER_REPMODE             */
#define _LETIMER_CTRL_REPMODE_MASK              0x3UL                                   /**< Bit mask for LETIMER_REPMODE                */
#define _LETIMER_CTRL_REPMODE_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define _LETIMER_CTRL_REPMODE_FREE              0x00000000UL                            /**< Mode FREE for LETIMER_CTRL                  */
#define _LETIMER_CTRL_REPMODE_ONESHOT           0x00000001UL                            /**< Mode ONESHOT for LETIMER_CTRL               */
#define _LETIMER_CTRL_REPMODE_BUFFERED          0x00000002UL                            /**< Mode BUFFERED for LETIMER_CTRL              */
#define _LETIMER_CTRL_REPMODE_DOUBLE            0x00000003UL                            /**< Mode DOUBLE for LETIMER_CTRL                */
#define LETIMER_CTRL_REPMODE_DEFAULT            (_LETIMER_CTRL_REPMODE_DEFAULT << 0)    /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_REPMODE_FREE               (_LETIMER_CTRL_REPMODE_FREE << 0)       /**< Shifted mode FREE for LETIMER_CTRL          */
#define LETIMER_CTRL_REPMODE_ONESHOT            (_LETIMER_CTRL_REPMODE_ONESHOT << 0)    /**< Shifted mode ONESHOT for LETIMER_CTRL       */
#define LETIMER_CTRL_REPMODE_BUFFERED           (_LETIMER_CTRL_REPMODE_BUFFERED << 0)   /**< Shifted mode BUFFERED for LETIMER_CTRL      */
#define LETIMER_CTRL_REPMODE_DOUBLE             (_LETIMER_CTRL_REPMODE_DOUBLE << 0)     /**< Shifted mode DOUBLE for LETIMER_CTRL        */
#define _LETIMER_CTRL_UFOA0_SHIFT               2                                       /**< Shift value for LETIMER_UFOA0               */
#define _LETIMER_CTRL_UFOA0_MASK                0xCUL                                   /**< Bit mask for LETIMER_UFOA0                  */
#define _LETIMER_CTRL_UFOA0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define _LETIMER_CTRL_UFOA0_NONE                0x00000000UL                            /**< Mode NONE for LETIMER_CTRL                  */
#define _LETIMER_CTRL_UFOA0_TOGGLE              0x00000001UL                            /**< Mode TOGGLE for LETIMER_CTRL                */
#define _LETIMER_CTRL_UFOA0_PULSE               0x00000002UL                            /**< Mode PULSE for LETIMER_CTRL                 */
#define _LETIMER_CTRL_UFOA0_PWM                 0x00000003UL                            /**< Mode PWM for LETIMER_CTRL                   */
#define LETIMER_CTRL_UFOA0_DEFAULT              (_LETIMER_CTRL_UFOA0_DEFAULT << 2)      /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_UFOA0_NONE                 (_LETIMER_CTRL_UFOA0_NONE << 2)         /**< Shifted mode NONE for LETIMER_CTRL          */
#define LETIMER_CTRL_UFOA0_TOGGLE               (_LETIMER_CTRL_UFOA0_TOGGLE << 2)       /**< Shifted mode TOGGLE for LETIMER_CTRL        */
#define LETIMER_CTRL_UFOA0_PULSE                (_LETIMER_CTRL_UFOA0_PULSE << 2)        /**< Shifted mode PULSE for LETIMER_CTRL         */
#define LETIMER_CTRL_UFOA0_PWM                  (_LETIMER_CTRL_UFOA0_PWM << 2)          /**< Shifted mode PWM for LETIMER_CTRL           */
#define _LETIMER_CTRL_UFOA1_SHIFT               4                                       /**< Shift value for LETIMER_UFOA1               */
#define _LETIMER_CTRL_UFOA1_MASK                0x30UL                                  /**< Bit mask for LETIMER_UFOA1                  */
#define _LETIMER_CTRL_UFOA1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define _LETIMER_CTRL_UFOA1_NONE                0x00000000UL                            /**< Mode NONE for LETIMER_CTRL                  */
#define _LETIMER_CTRL_UFOA1_TOGGLE              0x00000001UL                            /**< Mode TOGGLE for LETIMER_CTRL                */
#define _LETIMER_CTRL_UFOA1_PULSE               0x00000002UL                            /**< Mode PULSE for LETIMER_CTRL                 */
#define _LETIMER_CTRL_UFOA1_PWM                 0x00000003UL                            /**< Mode PWM for LETIMER_CTRL                   */
#define LETIMER_CTRL_UFOA1_DEFAULT              (_LETIMER_CTRL_UFOA1_DEFAULT << 4)      /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_UFOA1_NONE                 (_LETIMER_CTRL_UFOA1_NONE << 4)         /**< Shifted mode NONE for LETIMER_CTRL          */
#define LETIMER_CTRL_UFOA1_TOGGLE               (_LETIMER_CTRL_UFOA1_TOGGLE << 4)       /**< Shifted mode TOGGLE for LETIMER_CTRL        */
#define LETIMER_CTRL_UFOA1_PULSE                (_LETIMER_CTRL_UFOA1_PULSE << 4)        /**< Shifted mode PULSE for LETIMER_CTRL         */
#define LETIMER_CTRL_UFOA1_PWM                  (_LETIMER_CTRL_UFOA1_PWM << 4)          /**< Shifted mode PWM for LETIMER_CTRL           */
#define LETIMER_CTRL_OPOL0                      (0x1UL << 6)                            /**< Output 0 Polarity                           */
#define _LETIMER_CTRL_OPOL0_SHIFT               6                                       /**< Shift value for LETIMER_OPOL0               */
#define _LETIMER_CTRL_OPOL0_MASK                0x40UL                                  /**< Bit mask for LETIMER_OPOL0                  */
#define _LETIMER_CTRL_OPOL0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define LETIMER_CTRL_OPOL0_DEFAULT              (_LETIMER_CTRL_OPOL0_DEFAULT << 6)      /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_OPOL1                      (0x1UL << 7)                            /**< Output 1 Polarity                           */
#define _LETIMER_CTRL_OPOL1_SHIFT               7                                       /**< Shift value for LETIMER_OPOL1               */
#define _LETIMER_CTRL_OPOL1_MASK                0x80UL                                  /**< Bit mask for LETIMER_OPOL1                  */
#define _LETIMER_CTRL_OPOL1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define LETIMER_CTRL_OPOL1_DEFAULT              (_LETIMER_CTRL_OPOL1_DEFAULT << 7)      /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_BUFTOP                     (0x1UL << 8)                            /**< Buffered Top                                */
#define _LETIMER_CTRL_BUFTOP_SHIFT              8                                       /**< Shift value for LETIMER_BUFTOP              */
#define _LETIMER_CTRL_BUFTOP_MASK               0x100UL                                 /**< Bit mask for LETIMER_BUFTOP                 */
#define _LETIMER_CTRL_BUFTOP_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define _LETIMER_CTRL_BUFTOP_DISABLE            0x00000000UL                            /**< Mode DISABLE for LETIMER_CTRL               */
#define _LETIMER_CTRL_BUFTOP_ENABLE             0x00000001UL                            /**< Mode ENABLE for LETIMER_CTRL                */
#define LETIMER_CTRL_BUFTOP_DEFAULT             (_LETIMER_CTRL_BUFTOP_DEFAULT << 8)     /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_BUFTOP_DISABLE             (_LETIMER_CTRL_BUFTOP_DISABLE << 8)     /**< Shifted mode DISABLE for LETIMER_CTRL       */
#define LETIMER_CTRL_BUFTOP_ENABLE              (_LETIMER_CTRL_BUFTOP_ENABLE << 8)      /**< Shifted mode ENABLE for LETIMER_CTRL        */
#define LETIMER_CTRL_CNTTOPEN                   (0x1UL << 9)                            /**< Compare Value 0 Is Top Value                */
#define _LETIMER_CTRL_CNTTOPEN_SHIFT            9                                       /**< Shift value for LETIMER_CNTTOPEN            */
#define _LETIMER_CTRL_CNTTOPEN_MASK             0x200UL                                 /**< Bit mask for LETIMER_CNTTOPEN               */
#define _LETIMER_CTRL_CNTTOPEN_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define _LETIMER_CTRL_CNTTOPEN_DISABLE          0x00000000UL                            /**< Mode DISABLE for LETIMER_CTRL               */
#define _LETIMER_CTRL_CNTTOPEN_ENABLE           0x00000001UL                            /**< Mode ENABLE for LETIMER_CTRL                */
#define LETIMER_CTRL_CNTTOPEN_DEFAULT           (_LETIMER_CTRL_CNTTOPEN_DEFAULT << 9)   /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_CNTTOPEN_DISABLE           (_LETIMER_CTRL_CNTTOPEN_DISABLE << 9)   /**< Shifted mode DISABLE for LETIMER_CTRL       */
#define LETIMER_CTRL_CNTTOPEN_ENABLE            (_LETIMER_CTRL_CNTTOPEN_ENABLE << 9)    /**< Shifted mode ENABLE for LETIMER_CTRL        */
#define LETIMER_CTRL_DEBUGRUN                   (0x1UL << 12)                           /**< Debug Mode Run Enable                       */
#define _LETIMER_CTRL_DEBUGRUN_SHIFT            12                                      /**< Shift value for LETIMER_DEBUGRUN            */
#define _LETIMER_CTRL_DEBUGRUN_MASK             0x1000UL                                /**< Bit mask for LETIMER_DEBUGRUN               */
#define _LETIMER_CTRL_DEBUGRUN_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define _LETIMER_CTRL_DEBUGRUN_DISABLE          0x00000000UL                            /**< Mode DISABLE for LETIMER_CTRL               */
#define _LETIMER_CTRL_DEBUGRUN_ENABLE           0x00000001UL                            /**< Mode ENABLE for LETIMER_CTRL                */
#define LETIMER_CTRL_DEBUGRUN_DEFAULT           (_LETIMER_CTRL_DEBUGRUN_DEFAULT << 12)  /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_DEBUGRUN_DISABLE           (_LETIMER_CTRL_DEBUGRUN_DISABLE << 12)  /**< Shifted mode DISABLE for LETIMER_CTRL       */
#define LETIMER_CTRL_DEBUGRUN_ENABLE            (_LETIMER_CTRL_DEBUGRUN_ENABLE << 12)   /**< Shifted mode ENABLE for LETIMER_CTRL        */
#define _LETIMER_CTRL_CNTPRESC_SHIFT            16                                      /**< Shift value for LETIMER_CNTPRESC            */
#define _LETIMER_CTRL_CNTPRESC_MASK             0xF0000UL                               /**< Bit mask for LETIMER_CNTPRESC               */
#define _LETIMER_CTRL_CNTPRESC_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_CTRL               */
#define _LETIMER_CTRL_CNTPRESC_DIV1             0x00000000UL                            /**< Mode DIV1 for LETIMER_CTRL                  */
#define _LETIMER_CTRL_CNTPRESC_DIV2             0x00000001UL                            /**< Mode DIV2 for LETIMER_CTRL                  */
#define _LETIMER_CTRL_CNTPRESC_DIV4             0x00000002UL                            /**< Mode DIV4 for LETIMER_CTRL                  */
#define _LETIMER_CTRL_CNTPRESC_DIV8             0x00000003UL                            /**< Mode DIV8 for LETIMER_CTRL                  */
#define _LETIMER_CTRL_CNTPRESC_DIV16            0x00000004UL                            /**< Mode DIV16 for LETIMER_CTRL                 */
#define _LETIMER_CTRL_CNTPRESC_DIV32            0x00000005UL                            /**< Mode DIV32 for LETIMER_CTRL                 */
#define _LETIMER_CTRL_CNTPRESC_DIV64            0x00000006UL                            /**< Mode DIV64 for LETIMER_CTRL                 */
#define _LETIMER_CTRL_CNTPRESC_DIV128           0x00000007UL                            /**< Mode DIV128 for LETIMER_CTRL                */
#define _LETIMER_CTRL_CNTPRESC_DIV256           0x00000008UL                            /**< Mode DIV256 for LETIMER_CTRL                */
#define LETIMER_CTRL_CNTPRESC_DEFAULT           (_LETIMER_CTRL_CNTPRESC_DEFAULT << 16)  /**< Shifted mode DEFAULT for LETIMER_CTRL       */
#define LETIMER_CTRL_CNTPRESC_DIV1              (_LETIMER_CTRL_CNTPRESC_DIV1 << 16)     /**< Shifted mode DIV1 for LETIMER_CTRL          */
#define LETIMER_CTRL_CNTPRESC_DIV2              (_LETIMER_CTRL_CNTPRESC_DIV2 << 16)     /**< Shifted mode DIV2 for LETIMER_CTRL          */
#define LETIMER_CTRL_CNTPRESC_DIV4              (_LETIMER_CTRL_CNTPRESC_DIV4 << 16)     /**< Shifted mode DIV4 for LETIMER_CTRL          */
#define LETIMER_CTRL_CNTPRESC_DIV8              (_LETIMER_CTRL_CNTPRESC_DIV8 << 16)     /**< Shifted mode DIV8 for LETIMER_CTRL          */
#define LETIMER_CTRL_CNTPRESC_DIV16             (_LETIMER_CTRL_CNTPRESC_DIV16 << 16)    /**< Shifted mode DIV16 for LETIMER_CTRL         */
#define LETIMER_CTRL_CNTPRESC_DIV32             (_LETIMER_CTRL_CNTPRESC_DIV32 << 16)    /**< Shifted mode DIV32 for LETIMER_CTRL         */
#define LETIMER_CTRL_CNTPRESC_DIV64             (_LETIMER_CTRL_CNTPRESC_DIV64 << 16)    /**< Shifted mode DIV64 for LETIMER_CTRL         */
#define LETIMER_CTRL_CNTPRESC_DIV128            (_LETIMER_CTRL_CNTPRESC_DIV128 << 16)   /**< Shifted mode DIV128 for LETIMER_CTRL        */
#define LETIMER_CTRL_CNTPRESC_DIV256            (_LETIMER_CTRL_CNTPRESC_DIV256 << 16)   /**< Shifted mode DIV256 for LETIMER_CTRL        */

/* Bit fields for LETIMER CMD */
#define _LETIMER_CMD_RESETVALUE                 0x00000000UL                            /**< Default value for LETIMER_CMD               */
#define _LETIMER_CMD_MASK                       0x0000001FUL                            /**< Mask for LETIMER_CMD                        */
#define LETIMER_CMD_START                       (0x1UL << 0)                            /**< Start LETIMER                               */
#define _LETIMER_CMD_START_SHIFT                0                                       /**< Shift value for LETIMER_START               */
#define _LETIMER_CMD_START_MASK                 0x1UL                                   /**< Bit mask for LETIMER_START                  */
#define _LETIMER_CMD_START_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LETIMER_CMD                */
#define LETIMER_CMD_START_DEFAULT               (_LETIMER_CMD_START_DEFAULT << 0)       /**< Shifted mode DEFAULT for LETIMER_CMD        */
#define LETIMER_CMD_STOP                        (0x1UL << 1)                            /**< Stop LETIMER                                */
#define _LETIMER_CMD_STOP_SHIFT                 1                                       /**< Shift value for LETIMER_STOP                */
#define _LETIMER_CMD_STOP_MASK                  0x2UL                                   /**< Bit mask for LETIMER_STOP                   */
#define _LETIMER_CMD_STOP_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LETIMER_CMD                */
#define LETIMER_CMD_STOP_DEFAULT                (_LETIMER_CMD_STOP_DEFAULT << 1)        /**< Shifted mode DEFAULT for LETIMER_CMD        */
#define LETIMER_CMD_CLEAR                       (0x1UL << 2)                            /**< Clear LETIMER                               */
#define _LETIMER_CMD_CLEAR_SHIFT                2                                       /**< Shift value for LETIMER_CLEAR               */
#define _LETIMER_CMD_CLEAR_MASK                 0x4UL                                   /**< Bit mask for LETIMER_CLEAR                  */
#define _LETIMER_CMD_CLEAR_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LETIMER_CMD                */
#define LETIMER_CMD_CLEAR_DEFAULT               (_LETIMER_CMD_CLEAR_DEFAULT << 2)       /**< Shifted mode DEFAULT for LETIMER_CMD        */
#define LETIMER_CMD_CTO0                        (0x1UL << 3)                            /**< Clear Toggle Output 0                       */
#define _LETIMER_CMD_CTO0_SHIFT                 3                                       /**< Shift value for LETIMER_CTO0                */
#define _LETIMER_CMD_CTO0_MASK                  0x8UL                                   /**< Bit mask for LETIMER_CTO0                   */
#define _LETIMER_CMD_CTO0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LETIMER_CMD                */
#define LETIMER_CMD_CTO0_DEFAULT                (_LETIMER_CMD_CTO0_DEFAULT << 3)        /**< Shifted mode DEFAULT for LETIMER_CMD        */
#define LETIMER_CMD_CTO1                        (0x1UL << 4)                            /**< Clear Toggle Output 1                       */
#define _LETIMER_CMD_CTO1_SHIFT                 4                                       /**< Shift value for LETIMER_CTO1                */
#define _LETIMER_CMD_CTO1_MASK                  0x10UL                                  /**< Bit mask for LETIMER_CTO1                   */
#define _LETIMER_CMD_CTO1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LETIMER_CMD                */
#define LETIMER_CMD_CTO1_DEFAULT                (_LETIMER_CMD_CTO1_DEFAULT << 4)        /**< Shifted mode DEFAULT for LETIMER_CMD        */

